/*
Требуется безопасно и эффективно реализовать монитор с двумя потоками: потоком-поставщиком и потоком-потребителем. Поток-поставщик должен с задержкой в одну секунду инициировать условное событие, о чём должен выводить сообщение на экран. Поток-потребитель должен это условное событие получать, о чём также должен сообщать на экране. В итоге на экране должна появляться серия чередующихся сообщений об отправлении события и его обработке. Сообщения не должны нарушать очерёдность. Ожидание события должно происходить с минимальным потреблением процессорного времени, т. е. быть практически равным нулю. Подразумевается, что условное событие может содержать несериализуемые данные (скажем, передаётся экземпляр класса по указателю).
*/

package main

import (
	"fmt"
	"time"
)

func main() {
	ch := make(chan string, 1)

	go listen(ch)
	go send(ch, "Message!")

	for {
	}
}

func listen(ch chan string) {
	fmt.Println("Start listening:", time.Now())
	for {
		msg := <-ch
		fmt.Println(msg, "| RCV")
	}
}

func send(ch chan string, msg string) {
	for {
		fmt.Println(msg, "| SENT")
		ch <- msg
		time.Sleep(1000)
	}
}
